###################################################################

# Created by write_sdc on Tue Feb 21 09:14:16 2023

###################################################################
set sdc_version 2.1

set_load -pin_load 1 [get_ports {fwd_o[23]}]
set_load -pin_load 1 [get_ports {fwd_o[22]}]
set_load -pin_load 1 [get_ports {fwd_o[21]}]
set_load -pin_load 1 [get_ports {fwd_o[20]}]
set_load -pin_load 1 [get_ports {fwd_o[19]}]
set_load -pin_load 1 [get_ports {fwd_o[18]}]
set_load -pin_load 1 [get_ports {fwd_o[17]}]
set_load -pin_load 1 [get_ports {fwd_o[16]}]
set_load -pin_load 1 [get_ports {fwd_o[15]}]
set_load -pin_load 1 [get_ports {fwd_o[14]}]
set_load -pin_load 1 [get_ports {fwd_o[13]}]
set_load -pin_load 1 [get_ports {fwd_o[12]}]
set_load -pin_load 1 [get_ports {fwd_o[11]}]
set_load -pin_load 1 [get_ports {fwd_o[10]}]
set_load -pin_load 1 [get_ports {fwd_o[9]}]
set_load -pin_load 1 [get_ports {fwd_o[8]}]
set_load -pin_load 1 [get_ports {fwd_o[7]}]
set_load -pin_load 1 [get_ports {fwd_o[6]}]
set_load -pin_load 1 [get_ports {fwd_o[5]}]
set_load -pin_load 1 [get_ports {fwd_o[4]}]
set_load -pin_load 1 [get_ports {fwd_o[3]}]
set_load -pin_load 1 [get_ports {fwd_o[2]}]
set_load -pin_load 1 [get_ports {fwd_o[1]}]
set_load -pin_load 1 [get_ports {fwd_o[0]}]
set_load -pin_load 1 [get_ports {fwd_datapath_o[23]}]
set_load -pin_load 1 [get_ports {fwd_datapath_o[22]}]
set_load -pin_load 1 [get_ports {fwd_datapath_o[21]}]
set_load -pin_load 1 [get_ports {fwd_datapath_o[20]}]
set_load -pin_load 1 [get_ports {fwd_datapath_o[19]}]
set_load -pin_load 1 [get_ports {fwd_datapath_o[18]}]
set_load -pin_load 1 [get_ports {fwd_datapath_o[17]}]
set_load -pin_load 1 [get_ports {fwd_datapath_o[16]}]
set_load -pin_load 1 [get_ports {fwd_datapath_o[15]}]
set_load -pin_load 1 [get_ports {fwd_datapath_o[14]}]
set_load -pin_load 1 [get_ports {fwd_datapath_o[13]}]
set_load -pin_load 1 [get_ports {fwd_datapath_o[12]}]
set_load -pin_load 1 [get_ports {fwd_datapath_o[11]}]
set_load -pin_load 1 [get_ports {fwd_datapath_o[10]}]
set_load -pin_load 1 [get_ports {fwd_datapath_o[9]}]
set_load -pin_load 1 [get_ports {fwd_datapath_o[8]}]
set_load -pin_load 1 [get_ports {fwd_datapath_o[7]}]
set_load -pin_load 1 [get_ports {fwd_datapath_o[6]}]
set_load -pin_load 1 [get_ports {fwd_datapath_o[5]}]
set_load -pin_load 1 [get_ports {fwd_datapath_o[4]}]
set_load -pin_load 1 [get_ports {fwd_datapath_o[3]}]
set_load -pin_load 1 [get_ports {fwd_datapath_o[2]}]
set_load -pin_load 1 [get_ports {fwd_datapath_o[1]}]
set_load -pin_load 1 [get_ports {fwd_datapath_o[0]}]
set_load -pin_load 1 [get_ports {bk_o[23]}]
set_load -pin_load 1 [get_ports {bk_o[22]}]
set_load -pin_load 1 [get_ports {bk_o[21]}]
set_load -pin_load 1 [get_ports {bk_o[20]}]
set_load -pin_load 1 [get_ports {bk_o[19]}]
set_load -pin_load 1 [get_ports {bk_o[18]}]
set_load -pin_load 1 [get_ports {bk_o[17]}]
set_load -pin_load 1 [get_ports {bk_o[16]}]
set_load -pin_load 1 [get_ports {bk_o[15]}]
set_load -pin_load 1 [get_ports {bk_o[14]}]
set_load -pin_load 1 [get_ports {bk_o[13]}]
set_load -pin_load 1 [get_ports {bk_o[12]}]
set_load -pin_load 1 [get_ports {bk_o[11]}]
set_load -pin_load 1 [get_ports {bk_o[10]}]
set_load -pin_load 1 [get_ports {bk_o[9]}]
set_load -pin_load 1 [get_ports {bk_o[8]}]
set_load -pin_load 1 [get_ports {bk_o[7]}]
set_load -pin_load 1 [get_ports {bk_o[6]}]
set_load -pin_load 1 [get_ports {bk_o[5]}]
set_load -pin_load 1 [get_ports {bk_o[4]}]
set_load -pin_load 1 [get_ports {bk_o[3]}]
set_load -pin_load 1 [get_ports {bk_o[2]}]
set_load -pin_load 1 [get_ports {bk_o[1]}]
set_load -pin_load 1 [get_ports {bk_o[0]}]
set_load -pin_load 1 [get_ports {bk_datapath_o[23]}]
set_load -pin_load 1 [get_ports {bk_datapath_o[22]}]
set_load -pin_load 1 [get_ports {bk_datapath_o[21]}]
set_load -pin_load 1 [get_ports {bk_datapath_o[20]}]
set_load -pin_load 1 [get_ports {bk_datapath_o[19]}]
set_load -pin_load 1 [get_ports {bk_datapath_o[18]}]
set_load -pin_load 1 [get_ports {bk_datapath_o[17]}]
set_load -pin_load 1 [get_ports {bk_datapath_o[16]}]
set_load -pin_load 1 [get_ports {bk_datapath_o[15]}]
set_load -pin_load 1 [get_ports {bk_datapath_o[14]}]
set_load -pin_load 1 [get_ports {bk_datapath_o[13]}]
set_load -pin_load 1 [get_ports {bk_datapath_o[12]}]
set_load -pin_load 1 [get_ports {bk_datapath_o[11]}]
set_load -pin_load 1 [get_ports {bk_datapath_o[10]}]
set_load -pin_load 1 [get_ports {bk_datapath_o[9]}]
set_load -pin_load 1 [get_ports {bk_datapath_o[8]}]
set_load -pin_load 1 [get_ports {bk_datapath_o[7]}]
set_load -pin_load 1 [get_ports {bk_datapath_o[6]}]
set_load -pin_load 1 [get_ports {bk_datapath_o[5]}]
set_load -pin_load 1 [get_ports {bk_datapath_o[4]}]
set_load -pin_load 1 [get_ports {bk_datapath_o[3]}]
set_load -pin_load 1 [get_ports {bk_datapath_o[2]}]
set_load -pin_load 1 [get_ports {bk_datapath_o[1]}]
set_load -pin_load 1 [get_ports {bk_datapath_o[0]}]
create_clock -name vclk  -period 70  -waveform {0 35}
set_clock_uncertainty 0  [get_clocks vclk]
set_input_delay -clock vclk  0  [get_ports {vec_i[7]}]
set_input_delay -clock vclk  0  [get_ports {vec_i[6]}]
set_input_delay -clock vclk  0  [get_ports {vec_i[5]}]
set_input_delay -clock vclk  0  [get_ports {vec_i[4]}]
set_input_delay -clock vclk  0  [get_ports {vec_i[3]}]
set_input_delay -clock vclk  0  [get_ports {vec_i[2]}]
set_input_delay -clock vclk  0  [get_ports {vec_i[1]}]
set_input_delay -clock vclk  0  [get_ports {vec_i[0]}]
set_output_delay -clock vclk  0  [get_ports {fwd_o[23]}]
set_output_delay -clock vclk  0  [get_ports {fwd_o[22]}]
set_output_delay -clock vclk  0  [get_ports {fwd_o[21]}]
set_output_delay -clock vclk  0  [get_ports {fwd_o[20]}]
set_output_delay -clock vclk  0  [get_ports {fwd_o[19]}]
set_output_delay -clock vclk  0  [get_ports {fwd_o[18]}]
set_output_delay -clock vclk  0  [get_ports {fwd_o[17]}]
set_output_delay -clock vclk  0  [get_ports {fwd_o[16]}]
set_output_delay -clock vclk  0  [get_ports {fwd_o[15]}]
set_output_delay -clock vclk  0  [get_ports {fwd_o[14]}]
set_output_delay -clock vclk  0  [get_ports {fwd_o[13]}]
set_output_delay -clock vclk  0  [get_ports {fwd_o[12]}]
set_output_delay -clock vclk  0  [get_ports {fwd_o[11]}]
set_output_delay -clock vclk  0  [get_ports {fwd_o[10]}]
set_output_delay -clock vclk  0  [get_ports {fwd_o[9]}]
set_output_delay -clock vclk  0  [get_ports {fwd_o[8]}]
set_output_delay -clock vclk  0  [get_ports {fwd_o[7]}]
set_output_delay -clock vclk  0  [get_ports {fwd_o[6]}]
set_output_delay -clock vclk  0  [get_ports {fwd_o[5]}]
set_output_delay -clock vclk  0  [get_ports {fwd_o[4]}]
set_output_delay -clock vclk  0  [get_ports {fwd_o[3]}]
set_output_delay -clock vclk  0  [get_ports {fwd_o[2]}]
set_output_delay -clock vclk  0  [get_ports {fwd_o[1]}]
set_output_delay -clock vclk  0  [get_ports {fwd_o[0]}]
set_output_delay -clock vclk  0  [get_ports {fwd_datapath_o[23]}]
set_output_delay -clock vclk  0  [get_ports {fwd_datapath_o[22]}]
set_output_delay -clock vclk  0  [get_ports {fwd_datapath_o[21]}]
set_output_delay -clock vclk  0  [get_ports {fwd_datapath_o[20]}]
set_output_delay -clock vclk  0  [get_ports {fwd_datapath_o[19]}]
set_output_delay -clock vclk  0  [get_ports {fwd_datapath_o[18]}]
set_output_delay -clock vclk  0  [get_ports {fwd_datapath_o[17]}]
set_output_delay -clock vclk  0  [get_ports {fwd_datapath_o[16]}]
set_output_delay -clock vclk  0  [get_ports {fwd_datapath_o[15]}]
set_output_delay -clock vclk  0  [get_ports {fwd_datapath_o[14]}]
set_output_delay -clock vclk  0  [get_ports {fwd_datapath_o[13]}]
set_output_delay -clock vclk  0  [get_ports {fwd_datapath_o[12]}]
set_output_delay -clock vclk  0  [get_ports {fwd_datapath_o[11]}]
set_output_delay -clock vclk  0  [get_ports {fwd_datapath_o[10]}]
set_output_delay -clock vclk  0  [get_ports {fwd_datapath_o[9]}]
set_output_delay -clock vclk  0  [get_ports {fwd_datapath_o[8]}]
set_output_delay -clock vclk  0  [get_ports {fwd_datapath_o[7]}]
set_output_delay -clock vclk  0  [get_ports {fwd_datapath_o[6]}]
set_output_delay -clock vclk  0  [get_ports {fwd_datapath_o[5]}]
set_output_delay -clock vclk  0  [get_ports {fwd_datapath_o[4]}]
set_output_delay -clock vclk  0  [get_ports {fwd_datapath_o[3]}]
set_output_delay -clock vclk  0  [get_ports {fwd_datapath_o[2]}]
set_output_delay -clock vclk  0  [get_ports {fwd_datapath_o[1]}]
set_output_delay -clock vclk  0  [get_ports {fwd_datapath_o[0]}]
set_output_delay -clock vclk  0  [get_ports {bk_o[23]}]
set_output_delay -clock vclk  0  [get_ports {bk_o[22]}]
set_output_delay -clock vclk  0  [get_ports {bk_o[21]}]
set_output_delay -clock vclk  0  [get_ports {bk_o[20]}]
set_output_delay -clock vclk  0  [get_ports {bk_o[19]}]
set_output_delay -clock vclk  0  [get_ports {bk_o[18]}]
set_output_delay -clock vclk  0  [get_ports {bk_o[17]}]
set_output_delay -clock vclk  0  [get_ports {bk_o[16]}]
set_output_delay -clock vclk  0  [get_ports {bk_o[15]}]
set_output_delay -clock vclk  0  [get_ports {bk_o[14]}]
set_output_delay -clock vclk  0  [get_ports {bk_o[13]}]
set_output_delay -clock vclk  0  [get_ports {bk_o[12]}]
set_output_delay -clock vclk  0  [get_ports {bk_o[11]}]
set_output_delay -clock vclk  0  [get_ports {bk_o[10]}]
set_output_delay -clock vclk  0  [get_ports {bk_o[9]}]
set_output_delay -clock vclk  0  [get_ports {bk_o[8]}]
set_output_delay -clock vclk  0  [get_ports {bk_o[7]}]
set_output_delay -clock vclk  0  [get_ports {bk_o[6]}]
set_output_delay -clock vclk  0  [get_ports {bk_o[5]}]
set_output_delay -clock vclk  0  [get_ports {bk_o[4]}]
set_output_delay -clock vclk  0  [get_ports {bk_o[3]}]
set_output_delay -clock vclk  0  [get_ports {bk_o[2]}]
set_output_delay -clock vclk  0  [get_ports {bk_o[1]}]
set_output_delay -clock vclk  0  [get_ports {bk_o[0]}]
set_output_delay -clock vclk  0  [get_ports {bk_datapath_o[23]}]
set_output_delay -clock vclk  0  [get_ports {bk_datapath_o[22]}]
set_output_delay -clock vclk  0  [get_ports {bk_datapath_o[21]}]
set_output_delay -clock vclk  0  [get_ports {bk_datapath_o[20]}]
set_output_delay -clock vclk  0  [get_ports {bk_datapath_o[19]}]
set_output_delay -clock vclk  0  [get_ports {bk_datapath_o[18]}]
set_output_delay -clock vclk  0  [get_ports {bk_datapath_o[17]}]
set_output_delay -clock vclk  0  [get_ports {bk_datapath_o[16]}]
set_output_delay -clock vclk  0  [get_ports {bk_datapath_o[15]}]
set_output_delay -clock vclk  0  [get_ports {bk_datapath_o[14]}]
set_output_delay -clock vclk  0  [get_ports {bk_datapath_o[13]}]
set_output_delay -clock vclk  0  [get_ports {bk_datapath_o[12]}]
set_output_delay -clock vclk  0  [get_ports {bk_datapath_o[11]}]
set_output_delay -clock vclk  0  [get_ports {bk_datapath_o[10]}]
set_output_delay -clock vclk  0  [get_ports {bk_datapath_o[9]}]
set_output_delay -clock vclk  0  [get_ports {bk_datapath_o[8]}]
set_output_delay -clock vclk  0  [get_ports {bk_datapath_o[7]}]
set_output_delay -clock vclk  0  [get_ports {bk_datapath_o[6]}]
set_output_delay -clock vclk  0  [get_ports {bk_datapath_o[5]}]
set_output_delay -clock vclk  0  [get_ports {bk_datapath_o[4]}]
set_output_delay -clock vclk  0  [get_ports {bk_datapath_o[3]}]
set_output_delay -clock vclk  0  [get_ports {bk_datapath_o[2]}]
set_output_delay -clock vclk  0  [get_ports {bk_datapath_o[1]}]
set_output_delay -clock vclk  0  [get_ports {bk_datapath_o[0]}]
